[{"text": " Why have you got that big map? Don't you use a map app to find new places? Well, no, I don't. I had a bad experience with a map app, so never again. Oh, really? What happened?", "start": 0.031, "end": 16.535}, {"text": " Do you remember when I was travelling around Borneo with my sister? Oh, yes. I saw all your photos online. It looked amazing. Well, yes, it was. But we didn't have a good time when we drove from Sabah to Brunei. My sister had a new map app for her phone.", "start": 16.754, "end": 36.397}, {"text": " I think it was called find it and follow it. It should be quite simple to use. You listen to the instructions and drive at the same time. Well, that was the plan. Sounds like a good plan to me. Yes, but it wasn't. We put the destination into the app and then we set off.", "start": 36.397, "end": 57.76}, {"text": " Everything was fine for the first hour. The map app told us to go straight on along the motorway. So that's what we did. Then it told us to take the next left at the roundabout. That's when everything started to go wrong. Oh, why? What did you find after the roundabout?", "start": 58.418, "end": 79.124}, {"text": " We were in the jungle, but the road was okay, so we carried on driving. Then the map app gave us a lot of directions quickly. It said we should take the next right, go past the petrol station, take the third on the left and so on.", "start": 79.529, "end": 97.67}, {"text": " Oh dear, were the directions too quick? No, no. The problem was that there was no right or left turn, no petrol station and no other roads. There was only jungle and nothing else. The road got smaller and smaller and the trees got bigger and bigger. Oh no, what did you do?", "start": 97.67, "end": 121.953}, {"text": " Well, you know my sister. She believes that technology is always right, so she wanted to continue. We drove deeper into the jungle, and the map app continued to give us full directions. Then the road stopped. What? What do you mean it stopped?", "start": 122.088, "end": 144.599}, {"text": " Suddenly there was no more road. There was only jungle. And it was getting dark. Finally my sister said that the map app must be wrong. We turned around and drove back to our starting point. It sounds like a terrible experience. I understand now why you don't like map apps.", "start": 144.683, "end": 169.928}]